;;=======================================================================
;; @ info
;;=======================================================================
(require 'info)

;;=======================================================================
;; @ misc
;;=======================================================================
(auto-compression-mode t)                       ; 日本語infoの文字化け防止
(setq delete-auto-save-files t)                 ; 終了時にオートセーブファイルを消す
(load "dired-x")                                ; dired-x （C-x C-j）
(fset 'yes-or-no-p 'y-or-n-p)                   ; "yes or no"を"y or n"に
(setq kill-whole-line t)                        ; 1行削除をC-k一回で出来るようにする

;;=======================================================================
;; @ auto-fill - 自動改行の設定（M-q で整形する）
;;=======================================================================
; 整形時の段落の区切りに日本語で使う区切りの種類を追加する
(setq paragraph-start '"^\\([ 　・○<\t\n\f]\\|(?[0-9a-zA-Z]+)\\)")

;;=======================================================================
;; @ default setting
;;=======================================================================
(setq inhibit-startup-message t)                ; 起動時のメッセージを抑止する
(setq inhibit-startup-echo-area-message -1)     ; スタートアップ時のエコー領域メッセージの非表示

;;=======================================================================
;; @ backup
;;=======================================================================
(setq make-backup-files nil)                    ; バックアップファイルを作らない
(setq auto-save-default nil)                    ; 自動保存しない
(setq auto-save-mode nil)                       ; 自動保存しない

;;=======================================================================
;; @ C-kで行が連結したときにインデントを減らす
;;=======================================================================
(defadvice kill-line (before kill-line-and-fixup activate)
  (when (and (not (bolp)) (eolp))
    (forward-char)
    (fixup-whitespace)
    (backward-char)))

;;=======================================================================
;; @ タブ
;;=======================================================================
(setq-default indent-tabs-mode nil)             ; ソフトタブ
(setq-default tab-width 4)                      ; TAB幅=4
(setq tab-stop-list                             ; タブ幅の倍数を設定
 '(  4   8  12  16  20  24  28  32  36  40
    44  48  52  56  60  64  68  72  76  80
    84  88  92  96 100 104 108 112 116 120))

;;=======================================================================
;; @ Symbolic link ファイル編集時に yes/no を聞かないようにする
;;=======================================================================
(setq vc-follow-symlinks t)
